# Блокчейн для чайников: Ультимативный гайд
Блокчейн был представлен как технология, лежащая в основе Биткойна — первой криптовалюты. Думайте об этом как об инфраструктуре для криптовалюты — если бы криптовалюты были автомобилями, блокчейн был бы дорогой. Хотя среди экспертов ведутся некоторые споры о будущем криптовалют, о светлом будущем технологии блокчейн спорить не приходится. В этом руководстве мы постараемся объяснить блокчейн простыми словами.

## Блокчейн — следующая большая вещь
Все согласны с тем, что эта технология является огромным достижением — возможно, самым большим с момента появления интернета. В результате большинство крупных компаний, таких как Google и Amazon, борются за свой кусок пирога, работая над [собственными блокчейн-решениями.](https://www.bloomberg.com/news/articles/2018-03-21/google-is-said-to-work-on-its-own-blockchain-related-technology) Время, потраченное на прочтение этого руководства, окупится с лихвой.

Сравните это с чтением книги об интернете в 1994 году, когда в телепередачах еще обсуждалось рождение электронной почты.
<iframe width="560" height="315" src="https://www.youtube.com/embed/UlJku_CSyNg" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

Будущее децентрализованной технологии светлое, и независимо от того, интересуетесь ли вы криптовалютами или технологией блокчейн, знание основ блокчейн является обязательным. Это включает в себя простое объяснение того, как работают блокчейны, какие проблемы они решают, и их невероятную пользу для мира.

### О чем НЕ рассказывает это руководство
Мы хотим уточнить, что это руководство не будет посвящено обучению разработке блокчейн или чему-то технически продвинутому. 

Если вы думаете стать профессионалом в области блокчейна или хотите узнать больше о его технических аспектах, мы предлагаем вам ознакомиться [с нашим партнером Blockgeeks](https://blockgeeks.com/join-now/) (используйте наши эксклюзивные коды купонов CryptoManiaksPRO и CryptoManiaksACC для 20% скидки на их премиальные продукты). 

Они предлагают лучшие ресурсы, доступные в Интернете для этой цели, и уже обучили невероятное количество профессионалов в области блокчейна. Технология блокчейн меняет мир вокруг нас, и мы рассмотрим многие из ее применений в этом руководстве.

Давайте начнем!

### Блокчейн для чайников: Простое объяснение
Блокчейн — это, по сути, цепочка блоков. Блоки содержат цифровую информацию, представьте их в виде пакетов данных, перевязанных, как рождественский подарок. 

![](https://cryptomaniaks.com/sites/default/files/pictures/chain_of_blocks_4-compressor.png)

В случае с блокчейном Биткойна:
- Внутри каждого блока находится серия транзакций биткоина, которые были проведены в течение определенного периода времени
- Все блоки вместе составляют блокчейн Биткойна и являются подтверждением всех транзакций, произошедших с момента его создания

### Какой была первая платформа, использовавшая блокчейн?
Биткойн, первый рабочий пример технологии блокчейн, был изобретен как ответ на неэффективность централизованных банковских учреждений. Его запуск в 2009 году, сразу после финансового краха 2007/2008 годов, не является случайным совпадением. Создатель(и) Биткойна был вдохновлен демократическим идеализмом, поощряющим индивидуальную автономию в рамках денежной (монетарной) системы.

### Где находится блокчейн?
По своей сути блокчейн — это сеть компьютеров, которые могут находиться по всему миру. Компьютеры, вносящие вклад в определенный блокчейн, обладают данными или транзакциями, которые когда-либо были записаны в этом блокчейне.
![](https://cryptomaniaks.com/sites/default/files/pictures/netork-architectures-compressor.png)

Именно эта особенность делает блокчейн децентрализованной и невероятно надежной, поскольку она способна пережить отключение электричества и политические потрясения. Чем больше компьютеров, тем сильнее блокчейн. Таким образом, блокчейн работает децентрализованно.

### Существует ли более чем один тип блокчейна?
На сегодняшний день существует, вероятно, более 10 000 блокчейнов. Большинство блокчейнов являются либо публичными, либо частными. 

**Публичные блокчейны.** В этом примере программное обеспечение с открытым исходным кодом используется всеми участниками сети. Любой может присоединиться, и сеть имеет глобальную основу. Например, многие криптовалюты построены на существующих блокчейнах, токены ERC20 — самый известный пример, построенный на Ethereum.

**Частные блокчейны.** В них используются те же принципы, что и в публичных, за исключением того, что программное обеспечение является запатентованным и размещается на частных серверах. Такие компании, как WalMart, разрабатывают свои собственные блокчейны для отслеживания логистики цепочки поставок.

### Технические преимущества блокчейна: Обзор
<iframe width="560" height="315" src="https://www.youtube.com/embed/6WG7D47tGb0" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

Источник: YouTube-канал Всемирного экономического форума

Технология блокчейн — одна из самых многообещающих новых технологий на сегодняшний день. Она обеспечивает метод записи и передачи данных прозрачным, надежным и доказуемым способом. Она позволяет частным лицам и компаниям участвовать в системе переводов, которая является полностью прозрачной, демократичной и безопасной.

Самое главное, она позволяет хранить и проводить транзакции без необходимости в посредниках. 

Возможно, вы еще не осознали влияние этих преимуществ, поэтому приведем несколько примеров, чтобы помочь вам.
1. Visa монетизирует доверие как посредник между магазинами и клиентами
2. Amazon монетизирует доверие как посредник между продавцами и покупателями
3. Uber монетизирует доверие как посредник между водителями и пользователями 

И этот список можно продолжать. Если вы обратили внимание, то каждый пример требует **доверить** посреднику вашу информацию. Наличие центрального узла сбора данных создает угрозу безопасности, ваша информация больше не принадлежит вам, теперь она принадлежит компании. Что они с ней делают — это их исключительное право.

Принятие технологии блокчейн устранит необходимость в третьих сторонах и позволит осуществлять одноранговые (peer-to-peer) транзакции без посредников.

В худшем случае это приведет к снижению затрат для компаний и платы для конечных пользователей услуг, основанных на доверии. 

В лучшем случае это полностью устранит необходимость в посредниках в большинстве отраслей.

### Практические преимущества блокчейна: Обзор
![](https://cryptomaniaks.com/sites/default/files/pictures/payments-compressed_0.gif)

Блокчейн уже разрушает такие отрасли, как:
1. **Банковское дело и платежи.** Технология блокчейн может предоставить доступ к финансовым услугам «небанковским» *(примечание переводчика: людям у которых есть сложности доступа к банковской системе, например страны Африки)* людям во всем мире. Она сделает денежную систему более прозрачной и для «банковских» людей. Большинство банков также разрабатывают свои собственные решения на основе блокчейна, поскольку это сделает их операции более быстрыми, безопасными и эффективными.
2. **Онлайн-хранилище данных.** Облачные системы хранения данных, как мы их знаем в настоящее время, опираются на большие централизованные базы данных. Это делает данные уязвимыми для нарушения конфиденциальности и потенциальной экологической катастрофы. Блокчейн делает данные более безопасными, устраняя точки отказа. Это также позволит создать еще более экономически эффективные варианты хранения данных.
3. **Голосование.** Блокчейн сделает выборы более прозрачными и справедливыми, чем когда-либо в истории человечества.

![](https://cryptomaniaks.com/sites/default/files/pictures/Industries-Blockchain-Will-Disrupt-compressor.png)

Технология блокчейн в настоящее время нарушает или нарушит работу любой отрасли, связанной с данными и транзакциями. Сюда входят экономические сектора, в которых задействованы посредники, монетизирующие доверие, подумайте о бюрократии в финансовых компаниях и даже правительствах.

*Далее в нашем руководстве мы более подробно рассмотрим каждый из аспектов, которые мы только что затронули. От преимуществ блокчейна до проблем, которые он решает, включая некоторые более продвинутые концепции.*

*Если вас не очень интересуют технические аспекты блокчейна и его взаимодействия с криптовалютами, пропустите и читайте главы, касающиеся преимуществ технологии блокчейн.*

## Как работают блокчейны
### Представляем вашему вниманию — майнеры
Термин «майнер» постоянно развивается, и каждый блокчейн имеет уникальные спецификации этого слова.

*Для простоты мы будем называть майнерами отдельных людей или компании, использующие специальное программное обеспечение для включения в блокчейн Биткойна.*

Майнеры необходимы для обеспечения функционирования блокчейна, без них не было бы компьютеров, управляющих сетью, и не было бы возможности проводить с ней транзакции.

<iframe width="560" height="315" src="https://www.youtube.com/embed/GmOzih6I1zs" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

Чтобы стимулировать майнеров, вознаграждение обычно получает компьютер, который находит следующий блок в публичной цепочке с открытым исходным кодом, такой как блокчейн Биткойна. Вознаграждения обычно распределяются через криптовалюты.

### Где хранится блокчейн? Давайте поговорим об узлах (nodes)
Узлы — это компьютеры, на которых размещена копия блокчейна. В отличие от майнеров, они не заинтересованы в поиске следующего блока в цепочке, вместо этого они подтверждают транзакции и общаются с другими узлами и майнерами.

Узлы можно рассматривать как ретранслирующие башни, помогающие базовому блокчейну обновляться и оставаться точным.

### Как создаются и проверяются новые блоки?
Каждый блок в блокчейне содержит определенные данные. В случае с биткойном данные — это серия транзакций. Эти данные организованы в единую цифровую папку.

Эта папка, блок в данном случае, подтверждается майнером, который добавляет ее к предыдущему блоку в блокчейне. 

Новые блоки транзакций записываются в блокчейн Биткойна каждые несколько минут. Это называется «майнинг» блоков. Это действие связывает новые блоки с уже существующей цепочкой блоков.

![](https://cryptomaniaks.com/sites/default/files/pictures/mining-compressed.gif)

Но чтобы быть добавленными в существующую цепочку блоков, **новые блоки должны быть подтверждены.** В этом заключается роль узлов. В случае с биткоином узлы отвечают за проверку транзакций, которые происходят в сети биткоина.

Это работает следующим образом: майнеры выбирают, какие транзакции включить в новый блок. Затем узлы проверяют все транзакции в блоке. И наконец, если все в порядке, узлы передают новый блок другим узлам.

### Протокол диктует правила блокчейна
Каждый блокчейн основан на протоколе (или «алгоритме консенсуса»). Протокол — это согласованный метод взаимодействия между компьютерами. Его можно представить как правила, которым должна следовать каждая машина в сети.

Например, у Bitcoin есть определенные правила, которые поддерживают стандарт протокола на всех машинах:
- 1 блок добавляется каждые 10 минут. Обычно это зависит от каждого блокчейна.
- Количество Биткойна, выдаваемого в качестве вознаграждения майнерам, уменьшается каждые 210 000 блоков. Это означает, что количество биткойнов ограничено — всего 21 миллион.
- Майнеры должны решить сложную математическую задачу, чтобы найти следующий блок. Протокол обеспечивает увеличение или уменьшение сложности поиска следующего блока в зависимости от количества майнеров, соревнующихся друг с другом.

### Блокчейн децентрализован. Почему это важно?
Программным обеспечением блокчейна управляют отдельные компьютеры, соединенные друг с другом через интернет со всего мира. Каждый компьютер в блокчейне работает под управлением одного и того же программного обеспечения. 

Если один из них отключается, сеть продолжает работать. Даже если каждый компьютер в мире одновременно выключится, блокчейн все равно будет хранить свои данные в распределенных бухгалтерских книгах.

Если во всем мире отключат электричество, на компьютерах останется копия бухгалтерской книги с момента ее последнего обновления. Мы не сможем обновить бухгалтерскую книгу до тех пор, пока электричество не будет восстановлено, но BTC не исчезнут. 

Эта характеристика делает технологию невероятно надежной, способной пережить отключение электроэнергии и политические потрясения.  

<iframe width="560" height="315" src="https://www.youtube.com/embed/3hnO4REnj7Q" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

Блокчейн — это метод цифрового обмена без посредника, распространяющийся на множество машин, на всех из которых запущена одна и та же программа. 

Распространяя бухгалтерские книги на каждый компьютер, работающий по протоколу, блокчейн устраняет необходимость в посредниках, централизованных органах власти и третьих сторонах.

Без третьих сторон пользователи могут взаимодействовать друг с другом напрямую, не нуждаясь в доверии или компенсации централизованных корпораций или правительств для ведения бизнеса. 

Это форма сотрудничества Peer-to-peer (P2P).

Сама по себе эта идея не является новой или радикальной; такие сервисы, как Napster и Limewire, использовали тот же принцип в начале 2000-х годов.

Разница заключается в возможности хранить цифровую информацию, включая транзакции в распределенной бухгалтерской книге, которая обещает неизменность (иммутабельность).

### Как обслуживается информация: Технология распределенных бухгалтерских книг
Чтобы сохранить историю транзакций во времени, копии всех блоков распределяются между участниками блокчейна. Эти участники называются узлами. Майнеры создают блокчейн, добывая блоки, но в качестве узла может выступать любой человек. 

Узлы управляют программным обеспечением блокчейна и постоянно обновляют информацию о блокчейне.

![](https://cryptomaniaks.com/sites/default/files/pictures/Types-Of-Ledger-Technology-compressor.png)

**Существуют различные типы узлов:**
- **Полные узлы**
На этих компьютерах работает полная копия блокчейна, содержащая информацию, начиная с генезисного (первоначального) блока.
- **Облегченные узлы**
Запуск этой версии содержит информацию только за несколько недель, а может быть, даже за несколько часов. Она быстрее запускается на машине, но имеет возможность быть не такой точной или безопасной, поскольку вам придется доверять другим людям, чтобы они предоставили недостающие данные.

Хостинг узла помогает поддерживать блокчейн в актуальном и точном состоянии. Узлы и майнеры постоянно перекрестно ссылаются друг на друга, чтобы построить и поддерживать блокчейн. 

Когда информация хранится на нескольких машинах, это называется технологией распределенных бухгалтерских книг (Distributed Ledger Technology, или DLT). Блокчейн — один из самых известных примеров этой технологии.

### Банки ведут централизованную бухгалтерскую книгу
Хорошим примером реальной ситуации является ваш банк. Для учета всех вносимых и изымаемых денег учреждение само ведет централизованную бухгалтерскую книгу.

Вы платите им за эту услугу, и это одна из основных причин, по которой были изобретены банки. Это также дорогостоящая инвестиция, требующая физической инфраструктуры и специалистов, работающих круглосуточно, чтобы поддерживать ее в рабочем состоянии.

Децентрализованный способ работы блокчейна контрастирует с традиционными банками.

Блокчейн размещается у каждого участника системы, что исключает необходимость в дорогостоящем центральном офисе. По сравнению с централизованной системой, у нее нет слабых мест, и она более экономически эффективна.

### Чем больше, тем лучше
Вспомним предыдущие главы этого руководства «Блокчейн для чайников». Упоминали ли мы о важности майнеров? Да, упомянули. Но мы не объяснили это подробно. 

Майнеры используют мощность процессора и электроэнергию для подтверждения следующего блока в блокчейне Биткойна.

Использование первичных ресурсов, таких как электроэнергия и вычислительная мощность, для подтверждения блоков называется Proof-of-Work.

Именно эта реальная стоимость делает протокол Биткойна таким надежным. Каждый блок в цепи уникален — считайте, что это осязаемый цифровой актив.

Чем больше майнеров находится в сети, тем она сильнее.

Сравните Биткойн, который имеет самую большую майнерскую сеть среди всех криптовалют, с совершенно новым блокчейном, который только запускается. У этого нового протокола меньше майнеров, что означает большую централизацию, больше слабых мест и меньше первичных ресурсов для создания и защиты информации.

Чем длиннее блокчейн, тем сильнее он становится.

Блокчейн Биткойна настолько огромен, что для его воссоздания потребовалось бы больше вычислительных мощностей, чем существует в настоящее время. Это делает транзакции чрезвычайно надежными, а протокол — чрезвычайно прочным.

## Применительно к криптовалютам
### Пример сети Биткойн в действии
Это очень базовый пример того, как работает транзакция Биткойна. Он описывает основы и должен помочь вам начать путешествие в удивительный мир криптовалюты.

![](https://cryptomaniaks.com/sites/default/files/pictures/steps_of_bitcoin_transaction-compressor.png)

- Пол хочет отправить 0,01 биткоина из своего кошелька в кошелек Эшли
- Открыв свой кошелек, он вводит публичный адрес Эшли в поле «адрес для отправки»
- Для подтверждения вывода транзакции Пол вводит свой приватный ключ в кошелек, который подтверждает сумму и отправляет транзакцию в блокчейн
- Даг — майнер. Он взимает плату в размере 0,000056 BTC. Эта плата служит стимулом для майнера включить транзакцию в следующий блок блокчейна. Кошелек Пола автоматически добавит комиссию к общей сумме транзакции
- Узлы подтверждают, что транзакция действительна, и добавляют ее в свою версию блокчейна
- Кошелек Эшли получает транзакцию в течение нескольких минут

Транзакции фиксируются по времени и добавляются в блок каждые несколько минут. В протоколе биткойна время между блоками составляет примерно 10 минут.

### Proof of Work — основа ценности биткоина
Теперь нет необходимости доверять банку или централизованному эскроу счету. Вместо этого мы можем доверять децентрализованной системе отдельных узлов, которые приходят к соглашению. 

Proof of Work — это [алгоритм консенсуса](https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC_%D0%9F%D0%B0%D0%BA%D1%81%D0%BE%D1%81), который стал известен благодаря Биткойну. Доказательство работы осуществляется с помощью аппаратного обеспечения. Майнеры используют майнинговые установки, которые постоянно пытаются найти следующий блок блокчейна Биткойна.

По сути, майнинг похож на решение сложной математической задачи путем угадывания.

Чем больше угадываний в секунду человек может выдать, тем больше у него шансов первым найти правильный ответ. Человек (или группа людей), который первым найдет следующий блок, получает вознаграждение в виде блока.

Именно так в схемах PoW происходит проверка транзакций блокчейна. Майнеры и узлы проверяют новые предложенные блоки. Люди инвестируют от сотен до миллионов долларов в оборудование для майнинга (как правило, это графические процессоры и много электроэнергии).

PoW — это то, что делает биткоин самой надежной и заслуживающей доверия криптовалютой из всех существующих.

По мере того как все больше майнеров соревнуются в добавлении блоков, сложность разгадывания шифра возрастает. Требуется больше мощности процессора и больше электроэнергии. И то, и другое имеет реальную стоимость.

Именно эта базовая инфраструктура делает биткойн таким безопасным и стабильным по сравнению с другими криптовалютами.

### Как на самом деле работают кошельки и адреса биткоина?
Пользователи сети биткоин могут переводить BTC любому человеку в мире. Для этого участники используют программное обеспечение, известное как кошелек. Каждый может сгенерировать столько адресов, сколько захочет, для этого не требуется никакой личной информации.

После создания каждый кошелек генерирует публичный адрес и закрытый ключ. У каждого из них своя функция, и понимание того, как они работают, необходимо при ориентировании в криптовалютном пространстве.

### Что такое открытый ключ (Public Key)?
Публичный адрес — это буквенно-цифровой код, уникальный идентификатор, который связывает транзакции с отправителем и получателем.

Например, [3D2oetdNuZUqQHPJmcMDDHYoqkyNVsFk9r](https://www.blockchain.com/btc/address/3D2oetdNuZUqQHPJmcMDDHYoqkyNVsFk9r) — один из самых богатых биткоин-адресов.

![](https://cryptomaniaks.com/sites/default/files/pictures/what-is-a-public-key-compressor.png)

**Публичный адрес используется для:**
- Получение платежей. Подумайте об этом как о банковских реквизитах, которые вы даете другу, чтобы он мог отправить вам деньги. Если вы хотите получать Bitcoin от друзей, создайте кошелек Bitcoin и отправьте им свой открытый ключ
- Доступ к истории транзакций по этому публичному адресу. Это одна из особенностей, которая делает биткоин псевдонимным: запись транзакции является публичной и доступна любому благодаря открытому ключу кошелька, но никто не может знать, кто владеет закрытым ключом, который позволяет получить доступ к средствам

### Что такое закрытый ключ (Private Key)?
Закрытый ключ — это совсем другое, и вы должны четко понимать разницу.

Закрытый ключ — это также буквенно-цифровой код, но этот ключ дает доступ к средствам кошелька. Он позволяет кому-либо выполнять транзакции из кошелька, например, отправлять Bitcoin на другой кошелек. Без закрытого ключа невозможно получить доступ к средствам, отправленным на публичный адрес кошелька.

![](https://cryptomaniaks.com/sites/default/files/pictures/what-is-a-private-key-compressor.png)

Закрытый ключ генерируется только один раз, и его необходимо защищать любой ценой. Если он будет утерян, вы не сможете получить доступ к своим средствам. Не существует программы, которая может восстановить потерянный ключ.

Вы никогда и никому не должны сообщать свой закрытый ключ.

## Преимущества технологии блокчейн
### Ценность технологии блокчейн

Основная ценность блокчейн заключается в способности хранить, проверять, распространять и постоянно записывать большие объемы данных, включая записи о транзакциях, что позволяет отстранить доверенную 3-ю сторону.

Технология автоматизирует обмен информацией на всех цифровых носителях. Грядет революция, которую возглавит технология блокчейн.

![](https://cryptomaniaks.com/sites/default/files/pictures/Why-blockchain-is-used-compressor.png)

### Блокчейн обеспечивает неизменяемость данных
Вся информация, хранящаяся в блокчейне, является постоянной и не может быть изменена. Информация является иммутабельной. 

Сравните это с традиционными методами хранения данных, которые требуют участия третьей стороны.

Необходимость участия человека в доверенных транзакциях неизбежно приводит к коррупции, раздутости и неэффективности. Блокчейн способен автоматизировать каждый из этих аспектов, что может привести к масштабным финансовым и социальным изменениям.

Биткойн доказывает, что блокчейн способен работать и действовать в качестве базовой инфраструктуры для новой денежной системы. Его неизменяемость также полезна для размещения видео и потокового контента.

С помощью блокчейна пользователи могут создавать уникальный контент, который нельзя украсть и бесконечно дублировать, что позволяет им лучше монетизировать свою работу.

Блокчейн не контролируется какой-либо одной организацией. Google, Facebook, Amazon и Microsoft - эти компании контролируют интернет. Большинство электронных писем, фотографий, видео и информации, передаваемой в сети, хранится на их собственных серверах.

Их услуги не бесплатны, продуктом являетесь вы. Когда вы пользуетесь "бесплатной" интернет-услугой, например, Gmail, компания монетизирует вашу информацию, собирает ваши личные привычки и продает их тому, кто больше заплатит.

Доминирование небольшого числа компаний в Интернете - это явление, известное как централизация, и оно ведет к коррупции и снижению стимулов для технического прогресса.

### Блокчейн создает цифровую свободу
В отличие от нынешнего технологического пространства, публичные блокчейны и созданные на их основе криптовалюты децентрализованы. Не существует организованной компании или группы людей, контролирующих информацию, хранящуюся в них, или даже то, как они работают.

Технология блокчейн бросит вызов существующим монополиям в технологическом пространстве.

Мир уже привык к обмену цифровой информацией и денежным операциям через Интернет.

Технология блокчейн еще больше улучшает наш технологический опыт и создает бесконечное количество возможностей для людей взаимодействовать друг с другом, не полагаясь на компании и третьи стороны.

Она привносит в цифровой мир свободу и предпринимательство на индивидуальном уровне.

![](https://cryptomaniaks.com/sites/default/files/pictures/Andreas-Antonopoulos-quote-compressor.png)

### Блокчейн не имеет единой точки отказа, что повышает безопасность
Современные технологические компании страдают от хакерских атак, в результате которых злоумышленники получают доступ к частной информации и крадут ее.

Дошло до того, что ваш адрес электронной почты и даже информация о кредитной карте были проданы или украдены, по крайней мере, один раз.

Существует целая индустрия, построенная на сборе ценной информации. 

Централизованные системы по своей сути находятся в невыгодном положении, поскольку преступники знают, где хранится их информация. Децентрализованные системы, с другой стороны, не имеют слабых мест.

Крупные публичные блокчейны распределены между сотнями тысяч компьютеров, и атаковать каждый из них одновременно было бы невозможно. Это делает блокчейн невероятно надежным и безопасным.

![](https://cryptomaniaks.com/sites/default/files/pictures/incredibly-robust-compressed_0.gif)

Допустим, вы покупаете пару обуви в Интернете. Это не обувь массового производства, которую вы найдете на Amazon, это обувь ручной работы, и она выглядит потрясающе.

У ремесленника, с которым вы хотите вести дела, небольшое предприятие, и они арендуют место на сервере для размещения своего сайта. Они используют простой плагин, чтобы помочь с транзакциями по кредитным картам.

К сожалению, без их или вашего ведома, сервер, на котором хранится их сайт, только что был взломан, и все ваши личные данные были собраны вредоносной программой.

Если бы вместо этого производитель обуви решил разместить на своем сайте публичный адрес Bitcoin, вы могли бы заказать пару обуви и отправить ему Bitcoin. Таким образом, его закрытый ключ не будет скомпрометирован.

<iframe width="560" height="315" src="https://www.youtube.com/embed/ru_vu-T0hd8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

Если вы, например, пользуетесь услугами традиционного банка, вы оказываете ему огромное доверие. Вы полагаетесь на то, что они безопасно обращаются с вашими деньгами, и можете только надеяться, что они предоставляют те услуги, которые обещают.

Во многих случаях реальность не соответствует этим ожиданиям. Люди сталкиваются с задержками при оплате, снятии и переводе денег.

Каждый день счета замораживаются или ограничиваются по непонятным для клиентов причинам.

Банки могут даже обанкротиться — как Lehman Brothers.

### Автоматизация обмена ценностями
Блокчейн автоматизирует обмен информацией (включая транзакции). Вместо того чтобы доверять компании, пользователи доверяют компьютерной программе с заранее установленными правилами.

Это позволяет бесконечно снизить комиссионные сборы. Например, в сетях блокчейн пользователи могут переводить миллионы долларов менее чем за $1,00.

По мере обострения конкуренции в сфере цифровых транзакций в пространстве блокчейн будут постоянно изобретаться более дешевые и быстрые варианты.

Времена, когда для совершения онлайн-покупок приходилось платить комиссию компаниям, обслуживающим кредитные карты, и полагаться на Paypal, подходят к концу.

![](https://cryptomaniaks.com/sites/default/files/pictures/fee-for-making-a-transfer-3-compressor.png)

### Снижение комиссионных сборов для торговцев и потребителей
Майнеры, создающие сеть и подтверждающие транзакции, взимают плату.

Каждый из них соревнуется с другими майнерами, чтобы решить криптографическую головоломку и получить возможность построить следующий блок. Это позволяет поддерживать пропорционально низкие затраты.

Автоматизация транзакций также снижает корпоративную бюрократию. Если вам не нужно платить тысячам сотрудников, плата за транзакции может быть безумно низкой.

Представьте, что у вас есть интернет-магазин, где продаются шерстяные шапки, и вы берете $20 за шапку.

Paypal берет ~4% комиссии за подтверждение денежных обменов такого размера. Если вы произведете 100 шапок, то Paypal примет 4 из них.

Можете ли вы представить, что это значит для торговцев по всему миру?

Такие компании, как Paypal, обходятся продавцам в миллиарды и миллиарды долларов. Что если бы вы могли снизить комиссию за денежные транзакции до $.01 или даже до доли цента?

Блокчейн делает это реальностью.

![](https://cryptomaniaks.com/sites/default/files/pictures/fees-compressed_0.gif)

### Блокчейн и криптовалюты позволяют сохранить анонимность
Криптовалюты, созданные на основе технологии блокчейн, дают людям возможность анонимно проводить транзакции и использовать деньги без вмешательства другой стороны.

Некоторым людям нравится отправлять ценности анонимно, а некоторые используют блокчейн как инструмент для возвращения своей конфиденциальности.

Поскольку мир продолжает переходить на цифровые технологии, правительства и крупные корпорации получают все больше контроля над нашими личными данными.

Сюда входит такая незначительная информация, как то, что вы изучали в колледже, имя вашего первого домашнего животного, ваши любимые рестораны, а также ваши привычки в расходовании средств и то, кому вы посылаете деньги.

Сочетание этой информации позволяет злоумышленникам легко получить инструменты, необходимые для того, чтобы начать контролировать вашу жизнь.

![](https://cryptomaniaks.com/sites/default/files/pictures/Who-Benefits-Most-From-Personal-Data-compressor.png)

Продукты блокчейн работают над тем, чтобы изменить все это.

Например, Monero - это криптовалюта, которая позволяет обмениваться ценностями, которые невозможно отследить.

Существует даже проект под названием Skycoin, который стремится создать анонимный протокол, способный конкурировать с Интернетом.

Возвращение людям свободы - это тенденция, которая будет продолжаться в сфере блокчейна.

### Блокчейн и криптовалюты как инструмент против финансового контроля
Известно, что банки и правительства не позволяют суверенным лицам тратить свои собственные деньги.

Одним из ярких примеров банковского провала является пример Wikileaks. Лица, которые в 2010 году хотели сделать пожертвование Wikileaks (смелой некоммерческой журналистской организации), используя традиционные банки, обнаружили, что их средства заморожены.

Однако биткойн предоставил альтернативу, которая позволила этим же людям без проблем сделать пожертвования Wikileaks.

![](https://cryptomaniaks.com/sites/default/files/pictures/Thomas-Jefferson-quote-compressor.png)

Свобода как результат блокчейна - это нечто большее, чем просто денежные транзакции.

Когда китайское правительство захочет подвергнуть цензуре интернет-поиск, оно сможет сделать это одним щелчком выключателя.

Децентрализованные системы обмена, такие как блокчейн, не позволяют авторитарным режимам контролировать поток информации.

Еще один пример, более близкий к дому, касается вашего банковского счета.

Сегодня федеральное правительство имеет возможность заморозить и ликвидировать ваши активы. Действительно ли это ваши деньги, если они могут использовать такой объем контроля над вами?

Такой объем власти над нашим личным богатством делает общество открытым для того, чтобы им воспользовались.

В странах, где правительство более коррумпировано или существуют мафиозные тенденции, денежные системы, основанные на блокчейне, становятся все более ценными.

### Блокчейн сделает цифровую информацию уникальной
Цифровые валюты - это, по сути, просто файлы, вспомните MP3 в качестве примера. Их способность к тиражированию, практически бесконечному, делает музыку труднодоступной для продажи.

Блокчейн изменил эту ситуацию. Теперь мы можем создавать цифровые активы, которые уникальны и не могут быть скопированы. Все это благодаря технологии распределенного учета.

Если бы вы хотели создать копию биткойна, вам пришлось бы перестраивать весь блокчейн!

![](https://cryptomaniaks.com/sites/default/files/pictures/Adam-Draper-quote-v3-compressor.png)

## Безопасен ли блокчейн?
### Основные опасения людей по поводу блокчейн
Надеемся, что наше руководство по блокчейну для чайников описало технологию блокчейна таким образом, чтобы показать вам, насколько она ценна.

Самой большой причиной, по которой люди сопротивляются внедрению криптовалют, является безопасность. В частности, страх потерять криптовалюты из-за хакеров, компьютерных ошибок или непредвиденной вредоносной деятельности.

Традиционные банковские операции считаются "проверенными и верными". Нас приучили пользоваться услугами банков, и у большинства людей никогда не возникало серьезных проблем с ними. Так зачем же нам принимать новый, относительно непроверенный способ делать то же самое?

### Действительно ли блокчейн безопаснее традиционных банков?
На самом деле технология блокчейн гораздо безопаснее традиционных банковских операций.

Публичные блокчейны имеют открытый исходный код: это позволяет каждому проверить кодовую базу и убедиться, что она работает так, как заявлено.

Кроме того, существует огромное сообщество, работающее над устранением любых потенциальных проблем. Сравните это с системами с закрытым исходным кодом, такими как банки, где вы должны доверять им.

Блокчейн имеет три уровня безопасности, которые защищают пользователей так, как не могут защитить другие альтернативы.

<iframe width="560" height="315" src="https://www.youtube.com/embed/Iq80oIGero8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

1. **Децентрализация**
Благодаря отсутствию единой точки отказа цифровые транзакции и другие ценные данные в блокчейне находятся в большей безопасности, чем на любом собственном сервере. Сравните это с банком, который хранит свою информацию на централизованных серверах.
2. **Криптография**
Превращение информации в цифровой код, который не позволяет другим пользователям получить к ней доступ. Технология стала настолько надежной, что даже АНБ не может взломать некоторые формы шифрования. Сравните вашу криптовалюту с фиатной валютой, может ли налоговая служба получить доступ к вашему банковскому счету?
3. **Майнеры и узлы**
Публичные блокчейны стимулируют проверку транзакций. Доверие создается не одной стороной, оно децентрализовано по всей платформе. Распределенная природа позволяет сети оставаться работоспособной даже в условиях политических и экологических катастроф.

### Доверие: Централизованное и децентрализованное
![](https://cryptomaniaks.com/sites/default/files/pictures/Andreas-Antonopoulos-quote-2-compressor.png)

Первый уровень безопасности - это децентрализация.

Если вы доверяете блокчейну, а не банку, вы не доверяете какому-то одному субъекту. Вы доверяете технологии.

Транзакции полностью автоматизированы, в протокол не вмешивается человек.

Это означает, что не существует централизованного органа, способного совершать огромные ошибки или надзирать и контролировать действия участников. Пока работает программное обеспечение, система работает.

### Что такое криптография и почему она повышает безопасность?
Второй уровень безопасности — это криптография. Точнее, цифровые подписи.

Каждая транзакция подписывается отправителем с помощью его закрытого ключа. Затем получатель использует открытый ключ отправителя, чтобы проверить, что транзакция действительно подписана законным владельцем.

Конечно, вам нужно будет тщательно следить за своими закрытыми ключами, как за золотом. Это будет вашей обязанностью. Храните их в тайне, берегите их.

### Как работают майнеры/узлы?
Третий и последний уровень безопасности блокчейна — это майнеры и/или узлы.

Эти майнеры/узлы участвуют в блокчейне, постоянно проверяя все транзакции, происходящие в блокчейне.

Переписывание или повреждение данных блокчейна практически невозможно, поскольку майнеры/узлы постоянно следят за тем, чтобы все данные блокчейна оставались корректными.

Для того чтобы изменить данные таким образом, чтобы нарушить целостность блокчейна, злоумышленник должен получить контроль над большинством майнеров/узлов блокчейна.

Это называется атакой 51%.

Крупные протоколы, такие как Биткойн, защищены от атак такого типа, поскольку они огромны.

Многие новые проекты начинаются как токены ERC-20, которые работают поверх протокола Ethereum. Ethereum безопасен, и создание новой криптовалюты на основе блокчейна Ethereum - надежная ставка.

Однако небольшие криптовалюты, создающие свой собственный блокчейн, все еще могут столкнуться с подобными опасностями, поэтому ранним инвесторам следует провести свое исследование.

### Стоит ли доверять блокчейн?
Децентрализация, криптография, а также майнеры и узлы представляют собой три чрезвычайно эффективных уровня безопасности блокчейна.

Технология постоянно совершенствуется и уже сейчас гораздо безопаснее, чем это представляется в СМИ.

Люди, которые пытаются дискредитировать блокчейн, основываясь на опасениях относительно безопасности, ошибаются.

Децентрализованная технология блокчейн более безопасна, чем традиционные способы хранения данных. Главный аргумент в пользу блокчейна всегда возвращается к финансовой автономии над активами.

Блокчейн дает эту власть в ваши руки.

![](https://cryptomaniaks.com/sites/default/files/pictures/cryptocurrency-coin-explosion-compressor.jpg)

В настоящее время существует более 10 000 криптовалют, использующих в той или иной форме технологию блокчейн.

Даже традиционное понимание технологии развивается быстрыми темпами.

Каждая криптовалюта отличается от других и заслуживает тщательного анализа для понимания.

## История блокчейна
### Когда начались первые работы над блокчейн?

#### 1991. Появилась первая работа над концепцией блокчейн-подобной технологии

Первое упоминание о технологии, похожей на блокчейн, относится к 1991 году, когда Стюарт Хабер и В. Скотт Сторнетта провели первую работу по созданию защищенной цепочки блоков.

#### 1992. В блокчейн-подобных технологии усовершенствована за счет включения деревьев Меркла.
В следующем, 1992 году, в блокчейн-технологию были введены деревья Меркла, которые позволили хранить несколько документов в одном блоке, что повысило эффективность блокчейна.

### Когда впервые возникла идея децентрализации?
#### 2002. Сформулирована концепция децентрализованного доверия в сетевой системе
Десять лет спустя, в 2002 году, концепция децентрализованного доверия в сетевой файловой системе была сформулирована Дэвидом Мазьером и Деннисом Шаша.

#### 2005. Предложена система Bitgold: Блокчейн-подобная система с PoW
В 2005 году Ник Сабо предложил Bitgold: протокол для децентрализованных прав собственности, включающий в себя блокчейн-подобную систему.

Этот протокол включал в себя функции Proof-of-Work и timestamping. К сожалению, у BitGold была одна фатальная слабость.

Было обнаружено, что тот, кто держал баланс BitGold, мог потратить свои монеты дважды, не будучи «пойманным» — эта слабость стала известна как «проблема двойной траты».

### Биткойн прибывает на сцену!
![](https://cryptomaniaks.com/sites/default/files/pictures/Bitcoin-arrives-on-the-scene-meme-compressor.jpg)

#### 2008 год. Опубликован Whitepaper Биткойна
Все, о чем говорилось до этого момента, заложило основу для первого настоящего блокчейна.

В то время как Хабер, Сторнетта, Мазьерис, Сабо и др. заигрывали с концепцией блокчейна, реальный блокчейн не был создан до 2008 года.

В 2008 году Сатоши Накамото опубликовал документ под названием «Биткойн — одноранговая система электронных денег». В этом документе была решена проблема двойной траты, которая беспокоила Bitgold, и он стал «white paper», написанной для первого реального, работающего блокчейна.

#### 2009. Биткойн запущен с использованием настоящей технологии блокчейн
В 2009 году, с помощью программиста Хэла Финни и других, Сатоши Накамото сделал Биткойн реальностью.

Код был написан, блокчейн родился, и Накамото сам добыл первые блоки. Хэл Финни был получателем самой первой транзакции биткоина, когда он получил 10 биткоинов от Накамото.

![](https://cryptomaniaks.com/sites/default/files/pictures/first_bitcoin_transaction-compressor.png)

### Блокчейн входит в массовое сознание
#### 2014. Инновации блокчейна привлекли внимание
В годы, последовавшие за выпуском биткойна, он приобрел огромную популярность и использование.

Он стал рассматриваться как законный способ оплаты - фактически, это был единственный способ, который можно было использовать для определенных целей (например, для пожертвований WikiLeaks).

С 2009 года по настоящее время мы наблюдаем огромное увеличение размеров файлов на блокчейне, инновации, меняющие принцип его работы, и бурный рост цен на криптовалюты, использующие технологию блокчейна.

### Как развивались блокчейны со времен Биткойна?
#### 2014. Блокчейн 2.0: Были разработаны концепции децентрализованных приложений и смарт-контрактов
В 2014 году термин Blockchain 2.0 был впервые использован в журнале The Economist.

Blockchain 2.0 относится к появлению приложений, которые могут выполняться на блокчейне. Это нововведение представляло собой огромный шаг вперед в технологии блокчейн.

Благодаря этой концепции появилась возможность запуска децентрализованных приложений (приложений, код которых распространяется среди децентрализованной сети пользователей, а не хранится в централизованном органе) на блокчейне, а смарт-контракты также стали возможными.

#### 2015. Ethereum запущен как первая криптовалюта, использующая Blockchain 2.0
Уже в следующем, 2015 году, был запущен первый блокчейн 2.0. Виталик Бутерин, участвовавший в создании Биткойна, увидел возможности для улучшения Биткойна и написал код для Ethereum.

Ethereum обещает обеспечить ту же функциональность, что и Bitcoin, но при этом будет обладать возможностью запуска децентрализованных приложений.

#### 2017. Первичные предложения монет и проекты на основе блокчейна стали обычным явлением
Хотя новые проекты на основе блокчейн появляются с тех пор, как инвесторы и инноваторы начали уделять внимание технологии блокчейн в 2014 году, 2017 год ознаменовался бурным ростом платформ на основе блокчейн.

Первичные предложения монет, также известные как ICO, в ходе которых ранним инвесторам предоставляется возможность приобрести первые акции проекта, стали чрезвычайно распространены в 2017 году.

![](https://cryptomaniaks.com/sites/default/files/pictures/funds-raised-by-icos-compressor.png)

### Технологии будут продолжать развиваться
Технология блокчейн используется и внедряется все шире.

От стартапов до крупных компаний, таких как Google и Amazon, будущее светлое. Определение понятия "блокчейн" меняется, и не все протоколы работают одинаково.

Однако информация, которую мы предоставили в этом руководстве, даст вам отличную основу для понимания этой технологии.

Когда вы начнете знакомиться с разрабатываемыми криптовалютами, вы обнаружите нюансы, которые отличают каждую монету.

### Поздравляем вас с завершением этого руководства «Блокчейн для чайников»!
Мы надеемся, что вам понравилось это руководство и вы узнали много нового о технологии блокчейн.

Если вам понравилась наша презентация и вы хотите помочь массовому внедрению блокчейна, поделитесь нашим руководством со своими друзьями и людьми, которых вы хотите видеть вовлеченными в процесс.

Наша цель в Cryptomaniaks — стать вашим лучшим гидом, когда вы начнете изучать удивительный мир криптовалют.

Если вы хотите узнать о технологии блокчейн более глубоко и стать экспертом, ознакомьтесь с онлайн-курсом нашего партнера BlockGeeks.

